#수치 연산자

#사칙연산
print(8*3)
print(8+3)
print(8-3)
print(8/3)


print("=============================")

print(8 / 3)
print(8.0 / 3)
print(8 / 3.0)
print(8.0 / 3.0)
print(type(8/2))

print("=======================================")

print(8//3) #몫 연산자
print(8%3) #나머지 연산자
print(8**4) #8의 3승
print(divmod(14,3)) #몫 나머지

print("========================================")
#연산자 우선순의
print(2 + 3 * 4)
print(-2 + 3 * 4)
print(-(2+3) * 4)
print((-2+3) * 4)


print(4 / 2 * 2)
print(4 / (2 * 2))
print("========================================")
print(2 ** 3 ** 4)
print(2 ** (3 ** 4))
print((2 ** 3) ** 4)
